docs/benchmarks/archive/real_benchmark_results.txt
TEST 1: Concurrency Sweep (Finding the Knee)
============================================
Testing concurrency: 1

Summary:
  Total:	30.0001 secs
  Slowest:	0.2456 secs
  Fastest:	0.0000 secs
  Average:	0.0000 secs
  Requests/sec:	24086.9553
  
  Total data:	254359424 bytes
  Size/request:	352 bytes

Response time histogram:
  0.000 [1]	|
  0.025 [722610]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.049 [0]	|
  0.074 [0]	|
  0.098 [0]	|
  0.123 [0]	|
  0.147 [0]	|
  0.172 [0]	|
  0.196 [0]	|
  0.221 [0]	|
  0.246 [1]	|


Latency distribution:
  10%% in 0.0000 secs
  25%% in 0.0000 secs
  50%% in 0.0000 secs
  75%% in 0.0000 secs
  90%% in 0.0001 secs
  95%% in 0.0001 secs
  99%% in 0.0001 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0000 secs, 0.0000 secs, 0.2428 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	722612 responses



---

Testing concurrency: 2

Summary:
  Total:	30.0001 secs
  Slowest:	0.0075 secs
  Fastest:	0.0000 secs
  Average:	0.0001 secs
  Requests/sec:	45634.6154
  
  Total data:	481902432 bytes
  Size/request:	481 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [999968]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [15]	|
  0.002 [4]	|
  0.003 [5]	|
  0.004 [3]	|
  0.004 [0]	|
  0.005 [0]	|
  0.006 [2]	|
  0.007 [0]	|
  0.007 [2]	|


Latency distribution:
  10%% in 0.0000 secs
  25%% in 0.0000 secs
  50%% in 0.0000 secs
  75%% in 0.0000 secs
  90%% in 0.0001 secs
  95%% in 0.0001 secs
  99%% in 0.0001 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0000 secs, 0.0000 secs, 0.0074 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1000000 responses



---

Testing concurrency: 4

Summary:
  Total:	30.0003 secs
  Slowest:	0.0337 secs
  Fastest:	0.0000 secs
  Average:	0.0001 secs
  Requests/sec:	56524.0848
  
  Total data:	596899424 bytes
  Size/request:	596 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [999832]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [85]	|
  0.010 [37]	|
  0.013 [6]	|
  0.017 [8]	|
  0.020 [0]	|
  0.024 [8]	|
  0.027 [7]	|
  0.030 [6]	|
  0.034 [10]	|


Latency distribution:
  10%% in 0.0000 secs
  25%% in 0.0000 secs
  50%% in 0.0001 secs
  75%% in 0.0001 secs
  90%% in 0.0001 secs
  95%% in 0.0001 secs
  99%% in 0.0002 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0260 secs
  resp wait:	0.0001 secs, 0.0000 secs, 0.0337 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0294 secs

Status code distribution:
  [200]	1000000 responses



---

Testing concurrency: 8

Summary:
  Total:	30.0010 secs
  Slowest:	0.0202 secs
  Fastest:	0.0000 secs
  Average:	0.0002 secs
  Requests/sec:	80853.0313
  
  Total data:	853836896 bytes
  Size/request:	853 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [999951]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [20]	|
  0.006 [8]	|
  0.008 [6]	|
  0.010 [13]	|
  0.012 [0]	|
  0.014 [0]	|
  0.016 [0]	|
  0.018 [0]	|
  0.020 [1]	|


Latency distribution:
  10%% in 0.0001 secs
  25%% in 0.0001 secs
  50%% in 0.0001 secs
  75%% in 0.0001 secs
  90%% in 0.0001 secs
  95%% in 0.0002 secs
  99%% in 0.0002 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0067 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0059 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0028 secs
  resp wait:	0.0002 secs, 0.0000 secs, 0.0174 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0084 secs

Status code distribution:
  [200]	1000000 responses